{
    "labels_tomato": [
        "Bacterial_spot",
        "Early_blight",
        "Healthy",
        "Late_blight",
        "Leaf_Mold",
        "Mosaic_virus",
        "Septoria_leaf_spot",
        "Spider_mites",
        "Target_Spot",
        "Yellow_Leaf_Curl_Virus",
        "non_leaf"
    ],
    "details_potato": {
        "Early_blight": {
            "isHealthy": false,
            "details": "<p><strong>রোগের নামঃ</strong> আলুর আগাম ধ্বসা <em>(Early Blight of Potato)</em><br/><strong>রোগের কারণঃ</strong> <em>Alternaria solani</em> নামক ছত্রাক দ্বারা এই রোগ হয়।</p><h3>লক্ষণঃ</h3><ul><li>নিচের পাতা ছোট ছোট বাদামী রংয়ের অল্প বসে যাওয়া কৌনিক দাগ পড়ে।</li><li>আক্রান্ত অংশে সামন্য বাদামী এলাকাকর সাথে পর্যায়ক্রমে কালচে রংয়ের চক্রাকার দাগ পড়ে।</li><li>পাতার বোটা ও কান্ডের দাগ অপেক্ষাকৃত লম্বা ধরনের হয়।</li><li>গাছ হলদে হয়, পাতা ঝরে পড়ে। অকালে গাছ মারা যেতে পারে।</li></ul><h3>সমন্বিত দমন ব্যবস্থাপনাঃ</h3><ul><li>সুস্থ, সবল ও রোগমুক্ত বীজ বপন করা।</li><li>রোগ মুক্ত বীজ সংগ্রহ করা।</li><li>প্রতিরোধ ক্ষমতা সম্পন্ন জাতের চাষ করা।</li><li>সুষম সার প্রয়োগ এবং সময়মত ও পরিমিত সেচ প্রয়োগ করা।</li><li>রোগ প্রতিরোধের জন্য প্রতি লিটার পানিতে রোভরাল ২ গ্রাম ও ডায়থেন এম- ৪৫, নেমিসপোর ২ গ্রাম মিশিয়ে ১০-১২ দিন পর পর স্প্রে করা (পাওয়ার স্পেয়ার দিয়ে)।</li></ul>",
            "diseaseName": "আগাম ধ্বসা রোগ"
        },
        "Healthy": {
            "isHealthy": true,
            "details": "",
            "diseaseName": ""
        },
        "Late_blight": {
            "isHealthy": false,
            "details": "<p><strong>রোগের নামঃ</strong> আলুর নাবী ধ্বসা <em>(Late Blight of Potato)</em><br/><strong>রোগের কারণঃ</strong> <em>Phytophthora</em> <em>infestans</em> নামক ছত্রাকের আক্রমণে এ রোগ হয়ে থাকে।</p><h3>লক্ষণঃ</h3><ul><li>এ রোগের আক্রমণে প্রথমে পাতায় ছোপ ছোপ ভেজা হালকা সবুজ গোলাকার বা এলোমেলো দাগ দেখা দেয়, যা দ্রুত কালো হয়ে পচে যায়।</li><li>গাছের কান্ড এবং টিউবারেও এ রোগের আক্রমণ দেখা যায়।</li><li>সকাল বেলা মাঠে গেলে পাতার নীচে সাদা সাদা পাউডারের মত ছত্রাক দেখা যায়।</li><li>তীব্র আক্রমণে সম্পূর্ণ জমির ফসল পুড়ে যায়। যদি রাতে নিম্ন তাপমাত্রা ও উচ্চ জলীয় বাষ্প এবং তার সাথে গুড়ি গুড়ি বৃষ্টি, কুয়াশা এবং পাতায় শিশির জমে থাকে তাহলে এ রোগ কয়েক দিনের মধ্যে মহামারী রূপ ধারণ করে। আক্রান্ত গাছ দ্রুত পাতা ও কা-সহ পচে যায় এবং ২-৩ দিনের মধ্যেই মাঠের সমস্ত গাছই মরে যেতে পারে।</li><li>আক্রান্ত আলুর গায়ে ও ভিতরের অংশে গাঢ় বাদামী থেকে কালচে বর্ণের দাগ পড়ে।</li><li>বাতাস, বৃষ্টিপাত, সেচের পানি ইত্যাদির সাহায্যে এ রোগের জীবাণু আক্রান্ত গাছ থেকে সুস্থ গাছে বিস্তার লাভ করে। বিকল্প পোষক যেমন টমেটো গাছ থেকেও এ রোগ বিস্তার লাভ করতে পারে।</li></ul><h3>সমন্বিত দমন ব্যবস্থাপনাঃ</h3><ul><li>রোগ প্রতিরোধী বা সহনশীল জাত যেমন-বারি আলু-৪৬, বারি আলু-৫৩, বারি আলু-৭৭ চাষ করা।</li><li>রোগমুক্ত বীজ ব্যবহার করা।</li><li>আক্রান্ত জমিতে সেচ বন্ধ করে দেওয়া।</li><li>সারিতে ভালভাবে মাটি উঁচু করে দেওয়া।</li><li>আগাম জাতের আলু চাষ করা এবং আগাম সংগ্রহ করা।</li><li>নিম্ন তাপমাত্রা, কুয়াশাচ্ছন্ন আবহাওয়া ও বৃষ্টির পূর্বাভাস পাওয়ার সাথে সাথে রোগ প্রতিরোধের জন্য ৭-১০ দিন অন্তর অন্তর ম্যানকোজেব গ্রুপের ছত্রাকনাশক যেমন- ডাইথেন এম-৪৫&#47; ইন্ডোফিল&#47; হেম্যানকোজেব&#47; ফরমোকোজেব ৮০ ডব্লিওপি&#47;মাইকোজেব ৮০ ডব্লিওপি ইত্যাদি প্রতি লিটার পানিতে ২ গ্রাম হারে মিশিয়ে স্প্রে করা।</li><li>জমিতে রোগ দেখা দেওয়া মাত্রই সিকিউর (২ গ্রাম&#47;লিটার) অথবা এক্রোভেট এম জেড (২ গ্রাম&#47;লিটার) অথবা মনা ২৮ এসসি (১ গ্রাম&#47;লিটার) অথবা মেলোডি ডিও ৪ গ্রাম + সিকিউর ২ গ্রাম (প্রতি লিটার পানিতে) অথবা এক্রোভেট এম জেড ২ গ্রাম + সিকিউর ১ গ্রাম (প্রতি লিটার পানিতে) অথবা মেলোডিডিও ১ গ্রাম + এক্রোভেট এম জেড ২ গ্রাম (প্রতি লিটার পানিতে), ৭ দিন অন্তর উপরোক্ত যে কোন একটি ছত্রাকনাশক বা ছত্রাকনাশকের মিশ্রণ স্প্রে করা।</li><li>এখানে উল্লেখ্য যে রোগের প্রাদুর্ভাব বেশী হলে আরো ঘন ঘন ঔষধ ছিটানোর প্রয়োজন পড়তে পারে। ভেজা অবস্থায় জমিতে ছত্রাকনাশক না দেয়াই ভাল। আর যদি দিতেই হয় তাহরে প্রতি লিটার পানিতে ২-৩ গ্রাম সাবানের গুঁড়া পাউডার যোগ করে নিতে হবে। ছত্রাকনাশক ভালভাবে ছিটাতে হবে যাতে পাতার নীচে ও উপরে ভালভাবে ভিজে যায়। এ ক্ষেত্রে সাধারন স্প্রেয়ারের পরিবর্তে পাওয়ার স্প্রেয়ার ভাল ফল দেয়।</li><li>মাটি ভেজা অবস্থায় কিংবা বৃষ্টির পর পর আলু না তুলে শুকনা অবস্থায় মাটিতে ‘জো’ এলে আলু তোলা।</li><li>হিমাগারে আলু রাখার আগে অত্যন্ত সতর্কতার সাথে বীজ বাছাই করতে হবে, যাতে কোনভাবে রোগাক্রান্ত আলু সুস্থ্য বীজের সাথে না থাকে।</li><li>রোগাক্রান্ত গাছ দিয়ে আলুর স্তুপ বা সংগৃহীত আলু ঢেকে রাখা যাবে না।</li><li>আলুর মৌসুমে নিয়মিত মাঠ পরিদর্শন করা।</li><li>মেটালেক্সিল গ্রুপের ছত্রাকনাশকের বিরুদ্ধে ফাইটোপথোরা ইনফেসট্যান্স এর নতুন রেস তৈরি হওয়ায় এখন থেকে ঐ গোত্রের ছত্রাকনাশক ব্যবহার করা যাবে না।</li><li>আক্রান্ত জমি হতে বীজ আলু সংগ্রহ করা যাবে না।</li></ul>",
            "diseaseName": "নাবী ধ্বসা রোগ"
        },
        "non_leaf": {
            "isHealthy": false,
            "details": "",
            "diseaseName": ""
        }
    },
    "details_tomato": {
        "Early_blight": {
            "isHealthy": false,
            "details": "<div><p><strong>রোগের নামঃ</strong> টমেটোর আগাম ধ্বসা বা আর্লি ব্লাইট রোগ <em>(Early Blight of Tomato)</em></p><p><strong>রোগের কারণঃ</strong> <em>Alternaria solani </em>নামক ছত্রাক দ্বারা এই রোগ হয়।</p><h3>লক্ষণঃ</h3><ul><li>এই রোগটি বীজবাহিত  এবং এ রোগের জীবাণু মাটিতে ও আগাছার মধ্যে এক বছরেরও বেশি সময় বেঁচে থাকতে পারে। পরে সেখান থেকে বাতাস, পানি ইত্যাদির মাধ্যমে বিস্তার লাভ করে।</li><li> এ রোগের আক্রমণে টমেটোর চারা মরে যায় এবং পাতা ও ফল ঝরে পড়ে।</li><li> তুলনামূলক ভাবে বর্ধনশীল বয়স্ক গাছেই এ রোগ বেশী দেখা যায়।</li><li> আক্রান্ত বীজ থেকে চারার বীজপত্রে প্রথমে গাঢ় রঙের ছোট ছোট দাগ পড়ে। পরে তা কা- ও পাতায় ছড়িয়ে যায়। শেষে চারা মরে যায়।</li><li>বয়স্ক গাছের পাতায় প্রথমে বৃত্তাকার দাগ বা এককেন্দ্রিক বলয়ের মত গাঢ় দাগ পড়ে।</li><li>ফলেও অনুরূপ কুঁচকানো বাদামী থেকে কালো রঙের বয়লাকৃতি দাগ সৃষ্টি হয় এবং আক্রান্ত ফল পাকার আগেই ঝরে পড়ে।</li></ul><h3>সমন্বিত দমন ব্যবস্থাপনাঃ</h3><ul><li>প্রোভে  বা ভিটাভে -২০০ (প্রতি কেজি বীজে ২.৫ গ্রাম) দিযে শোধন করে বীজ বপন করা।</li><li>যেখানে এ রোগ নিয়মিত ও বেশী হয় সেখানে রোপন সময় পরিবর্তন করে সম্ভব হলে শুষ্ক মৌসুমে এই ফসল চাষ করা।</li><li>রোগমুক্ত গাছ বা উৎস থেকে সংগৃহীত বীজ ব্যবহার করা।</li><li> শস্য পর্যায় অবলম্বন করা।</li><li>পাতা বেশী সময় ধরে ভেজা থাকলে এ রোগের জীবাণু বৃদ্ধি পায়। তাই ঝরনা সেচ না দেয়া।</li><li> অনুমোদিত ছত্রাক নাশক যেমন- রোভরাল ২ গ্রাম ১ লিটার হারে পানিতে মিশিয়ে সঠিক নিয়মে ১৫ দিন অন্তর স্প্রে করা।</li></ul></div>",
            "diseaseName": "আগাম ধ্বসা রোগ"
        },
        "Target_Spot": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "Target Spot"
        },
        "Late_blight": {
            "isHealthy": false,
            "details": "<p><strong>রোগের নামঃ</strong> টমেটোর নাবী ধ্বসা রোগ <em>(Late Blight of Tomato)</em><br/><strong>রোগের কারণঃ</strong> <em>Phytophthora infestans</em> নামক ছত্রাক দ্বারা এই রোগ হয়।</p><h3>লক্ষণঃ</h3><ul><li>পাতার উপরে ফ্যাকাশে অথবা ফিকে সবুজ রঙের গোলাকার অথবা এলোমেলো পানি ভেজা দাগ পড়ে।</li><li>কুয়াশাচ্ছন্ন ও মেগলা আবহাওয়ায় দাগ সংখ্যা ও আকার দ্রুত বাড়তে থাকে।</li><li>বাদামী থেকে কালচে রং ধারণ করে।</li><li>রোগের আক্রমণ বেশী হলে গাছের কান্ড ও সবুজ ফলেও রোগের লক্ষণ প্রকাশ পায়।</li><li>রোগের লক্ষণ দেখা দেয়ার ৩-৪ দিনের মধ্যে গাছ ঝলসে যায় ও দ্রুত মহমারী আকারে ছড়িয়ে পড়ে।</li></ul><h3>সমন্বিত দমন ব্যবস্থাপনাঃ</h3><ul><li>রোগমুক্ত এলাকা হতে সুস্থ বীজ সংগ্রহ করা।</li><li>সুস্থ, সবল ও রোগমুক্ত চারা রোপন করা।</li><li>রোগ সহনশীল জাত চাষ করা যেমন মানিক, রতন।</li><li>পরিমিত সার ব্যবহার ও সেচ প্রয়োগ করা।</li><li>শস্য পর্যায়ক্রম অনুসরণ করা।</li><li>রোগের অনুকুল পূর্বাভাস পাওয়া মাত্র প্রতিরোধকেক হিসাবে ২ গ্রাম ম্যানকোজেব + মেটালেক্সিল (রিডোমিল গোল্ড, করমিল, মেটারিল) জাতীয় ছত্রাকনাশক প্রতি লিটার পানিতে মিশিয়ে স্প্রে করা।</li><li>রোগের আক্রমণ বেশী হলে প্রতি লিটার পানিতে ২ গ্রাম সিকিউর মিশিয়ে স্প্রে করলে ভাল ফল পাওয়া যায়।</li></ul>",
            "diseaseName": "নাবী ধ্বসা রোগ"
        },
        "Bacterial_spot": {
            "isHealthy": false,
            "details": "<p>Coming Soon</p>",
            "diseaseName": "Bacterial Spot"
        },
        "Septoria_leaf_spot": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "Septoria Leaf Spot"
        },
        "Spider_mites": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "Spider Mites (Two-spotted Spider Mite)"
        },
        "Yellow_Leaf_Curl_Virus": {
            "isHealthy": false,
            "details": "<div><p><strong>রোগের নামঃ</strong> টমেটোর পাতা কোকড়ানো বা লিফ কার্ল রোগ <em>(Leaf Curl of Tomato)</em></p><p><strong>রোগের কারণঃ</strong> <em>Tomato Yellow Leaf Curl Virus (TYLCV)</em> এর আক্রমণে এ রোগ হয়।</p><h3>লক্ষণঃ</h3><ul><li>সাদা মাছি দ্বারা ভাইরাস ছড়ায়।</li><li>আক্রান্ত গাছ খর্বাকৃতি হয়।</li><li>পাতার গায়ে ঢেউয়ের মত ভাজের সৃষ্টি হয় ও পাতা ভীষণ ভাবে কোঁকড়ায়ে যায়।</li><li>বয়স্ক পাতা পুরু মচমচে হয়ে যায়।</li><li>আক্রমণ বেশী হলে পাতা মরে যায়।</li><li>গাছে অতিরিক্ত শাখা প্রশাখা বের হয় এবং ফুল ও ফল ধারণ ক্ষমতা হারিয়ে ফেলে।</li><li>পাতার কিনারা থেকে মধ্যশিরার দিকে গুটিয়ে যায়।</li><li>পাতা খসখসে হয়ে শিরাগুলো স্বচ্ছ হলুদ হয়ে কুঁকড়িয়ে যায় এবং পাতা গুলো পীতবর্ণ ধারণ করে।</li><li>আক্রান্ত গাছের ডগার পাতাগুলো ছোট ছোট গুচ্ছাকার ধারণ করে।</li><li>গাছ খর্বাকৃতির হয় ও ফল ছোট হয়।</li></ul><h3>সমন্বিত দমন ব্যবস্থাপনাঃ</h3><ul><li>আক্রান্ত গাছ দেখা মাত্র তুলে ধ্বংস করা।</li><li>রোগমুক্ত গাছ থেকে বীজ সংগ্রহ করা।</li><li>রোগ প্রতিরোধ ক্ষমতা সম্পন্ন জাত ব্যবহার করা।</li><li>ভাইরোসের বাহক পোকা (সাদা মাছি) দমনের জন্য ডাইয়মেথোয়েট (পারফেকথিয়ন), এসাটাফ, এডমায়ার, টিডো ইত্যাদি যে কোন একটি বালাইনাশক ব্যবহার করা।</li><li>ছোট ছিদ্রযুক্ত নাইলনের নেট দিয়ে বীজতলা ঢেকে চারা উৎপাদন করা।</li><li>চারা লাগানোর এক সপ্তাহ পর থেকে ফল আসা পর্যন্ত ১২ দিন পরপর কমপক্ষে ২ বার যে কোন কীটনাশক যেমন এ্যাডমায়ার (প্রতি লিটার পানিতে ১.৫ মিলি) প্রয়োগ করে সাদা মাছি দমন করা।</li><li>প্রাথমিক পর্যায়ে আক্রান্ত গাছ উঠিয়ে মাটিতে পুঁতে ফেলা।</li><li>জমি আগাছা মুক্ত রাখা।</li></ul></div>",
            "diseaseName": "পাতা কোকড়ানো রোগ"
        },
        "Mosaic_virus": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "টমেটো Mosaic Virus"
        },
        "Healthy": {
            "isHealthy": true,
            "details": "",
            "diseaseName": ""
        },
        "Leaf_Mold": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "Leaf Mold"
        },
        "non_leaf": {
            "isHealthy": false,
            "details": "",
            "diseaseName": ""
        }
    },
    "labels_potato": [
        "Early_blight",
        "Healthy",
        "Late_blight",
        "non_leaf"
    ],
    "labels_corn": [
        "Cercospora_leaf_spot",
        "Common_rust",
        "Healthy",
        "Northern_Leaf_Blight",
        "non_leaf"
    ],
    "details_corn": {
        "Healthy": {
            "isHealthy": true,
            "details": "",
            "diseaseName": "Healthy"
        },
        "Common_rust": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "Common Rust"
        },
        "Northern_Leaf_Blight": {
            "isHealthy": false,
            "details": "",
            "diseaseName": "Northern Leaf Blight"
        },
        "Cercospora_leaf_spot": {
            "isHealthy": false,
            "details": "<p>Nothing Avaiable yet.</p>",
            "diseaseName": "Cercospora Leaf Spot (Gray Leaf Spot)"
        },
        "non_leaf": {
            "isHealthy": false,
            "details": "",
            "diseaseName": ""
        }
    }
}
